Revit 2027 API
LinkElementId.Equality Operator
Determines whether these two LinkElementIds are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	LinkElementId first,
	LinkElementId second
)
Public Shared Operator = (
	first As LinkElementId,
	second As LinkElementId
) As Boolean
public:
static bool operator ==(
	LinkElementId^ first,
	LinkElementId^ second
)
static let inline (=)
        first : LinkElementId *
        second : LinkElementId  : bool
Parameters
first LinkElementId
The first LinkElementId.
second LinkElementId
The second LinkElementId.
Return Value
Boolean
True if the LinkElementIds are the same; otherwise, false.
See Also
Reference
LinkElementId Class
Autodesk.Revit.DB Namespace